In [1]:
import pandas

In [2]:
import numpy

In [3]:
import random

In [4]:
services_connective = pandas.read_csv("service_order_item.csv")
aux = pandas.read_csv("service.csv")

In [5]:
aux.columns

Index(['id', 'description', 'price', 'notes', 'created_at'], dtype='object')

In [6]:
services_connective.columns

Index(['id', 'service_order_id', 'product_id', 'service_id', 'price',
       'quantity', 'amount'],
      dtype='object')

In [7]:
aux.drop(['created_at',
          'price',
          'notes',
          'created_at'],
  axis='columns', inplace=True)

In [8]:
services_connective.drop(['id', 
                          'product_id', 
                          'price',
                          'quantity'],
  axis='columns', inplace=True)

In [9]:
services_connective

     service_order_id  service_id  amount
0                   2         1.0  104.00
1                   1         1.0   52.00
2                   1         NaN   87.00
3                   1         NaN  151.00
4                   1         NaN    1.50
..                ...         ...     ...
259               578         NaN    0.03
260               578         NaN    0.01
261               578         1.0    0.03
262               579         1.0    0.01
263               576         NaN   22.50

[264 rows x 3 columns]

In [10]:
aux

    id                              description
0    1                              Mao De Obra
1    3                       Usinagem Terceiros
2    4                Chapa Tecnil Sobre Medida
3    7                              Limpa Fossa
4    8  Revestimento Em Fibra Tanque De Retorno
5    9         Afiar Navalhas De Corte De Fita.
6   10                    Mão De Obra Terceiros
7   11                       Serviço Eletrônica
8   12                  serviço usinagem em PVC
9   13                         usinagem em inox
10  14                  serviço / corte / dobra

In [11]:
# trocando ids por seus valores

In [12]:
# pra substituir as entradas (de forma melhor)): 
# https://datascientyst.com/replace-values-column-based-another-dataframe-pandas/

In [13]:
services_connective

     service_order_id  service_id  amount
0                   2         1.0  104.00
1                   1         1.0   52.00
2                   1         NaN   87.00
3                   1         NaN  151.00
4                   1         NaN    1.50
..                ...         ...     ...
259               578         NaN    0.03
260               578         NaN    0.01
261               578         1.0    0.03
262               579         1.0    0.01
263               576         NaN   22.50

[264 rows x 3 columns]

In [14]:
random_list = []
for i in range(0,264):
    n = random.randint(0,6)
    random_list.append(n)

In [15]:
aux2 = pandas.DataFrame(numpy.array(random_list),
                   columns=['provider_id'])

In [16]:
aux2

     provider_id
0              3
1              3
2              2
3              0
4              4
..           ...
259            5
260            2
261            4
262            4
263            2

[264 rows x 1 columns]

In [17]:
services_connective = pandas.concat([services_connective, aux2], axis = 1)
# services_connective = services_connective.merge(aux2, how='right', on='id')

In [19]:
for i in range(len(services_connective)):
    if not services_connective["service_id"][i] > 0:
        services_connective["provider_id"][i] = numpy.NaN

C:\Users\lucas\AppData\Local\Temp/ipykernel_14352/2787272509.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  services_connective["provider_id"][i] = numpy.NaN
C:\Users\lucas\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [20]:
services_connective

     service_order_id  service_id  amount  provider_id
0                   2         1.0  104.00          3.0
1                   1         1.0   52.00          3.0
2                   1         NaN   87.00          NaN
3                   1         NaN  151.00          NaN
4                   1         NaN    1.50          NaN
..                ...         ...     ...          ...
259               578         NaN    0.03          NaN
260               578         NaN    0.01          NaN
261               578         1.0    0.03          4.0
262               579         1.0    0.01          4.0
263               576         NaN   22.50          NaN

[264 rows x 4 columns]

In [21]:
services_connective.to_csv('services_connective.csv')